4ms/mdrivlib/target/stm32f7xx/boot/startup.s
/**
  ******************************************************************************
  * @file      startup_stm32f746xx.s
  * @author    MCD Application Team
  * @brief     STM32F746xx Devices vector table for GCC based toolchain. 
  *            This module performs:
  *                - Set the initial SP
  *                - Set the initial PC == Reset_Handler,
  *                - Set the vector table entries with the exceptions ISR address
  *                - Branches to main in the C library (which eventually
  *                  calls main()).
  *            After Reset the Cortex-M7 processor is in Thread mode,
  *            priority is Privileged, and the Stack is set to Main.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
    
  .syntax unified
  .cpu cortex-m7
  .fpu softvfp
  .thumb

.global  g_pfnVectors
.global  Default_Handler

/* start address for the initialization values of the .data section. 
defined in linker script */
.word  _sidata
/* start address for the .data section. defined in linker script */  
.word  _sdata
/* end address for the .data section. defined in linker script */
.word  _edata
/* start address for the .bss section. defined in linker script */
.word  _sbss
/* end address for the .bss section. defined in linker script */
.word  _ebss
/* stack used for SystemInit_ExtMemCtl; always internal RAM used */

/**
 * @brief  This is the code that gets called when the processor first
 *          starts execution following a reset event. Only the absolutely
 *          necessary set is performed, after which the application
 *          supplied main() routine is called. 
 * @param  None
 * @retval : None
*/

    .section  .text.Reset_Handler
  .weak  Reset_Handler
  .type  Reset_Handler, %function
Reset_Handler:  
  ldr   sp, =_estack      /* set stack pointer */

/* Copy the data segment initializers from flash to SRAM */  
  ldr r0, =_sdata
  ldr r1, =_edata
  ldr r2, =_sidata
  movs r3, #0
  b LoopCopyDataInit

CopyDataInit:
  ldr r4, [r2, r3]
  str r4, [r0, r3]
  adds r3, r3, #4

LoopCopyDataInit:
  adds r4, r0, r3
  cmp r4, r1
  bcc CopyDataInit
  
/* Zero fill the bss segment. */
  ldr r2, =_sbss
  ldr r4, =_ebss
  movs r3, #0
  b LoopFillZerobss

FillZerobss:
  str  r3, [r2]
  adds r2, r2, #4

LoopFillZerobss:
  cmp r2, r4
  bcc FillZerobss

/* Call the clock system initialization function.*/
  bl  SystemInit   
/* Call static constructors */
    bl __libc_init_array
/* Call the application's entry point.*/
  bl  main
  bx  lr    
.size  Reset_Handler, .-Reset_Handler

/**
 * @brief  This is the code that gets called when the processor receives an 
 *         unexpected interrupt.  This simply enters an infinite loop, preserving
 *         the system state for examination by a debugger.
 * @param  None     
 * @retval None       
*/
    .section  .text.Default_Handler,"ax",%progbits
Default_Handler:
Infinite_Loop:
  b  Infinite_Loop
  .size  Default_Handler, .-Default_Handler
/******************************************************************************
*
* The minimal vector table for a Cortex M7. Note that the proper constructs
* must be placed on this to ensure that it ends up at physical address
* 0x0000.0000.
* 
*******************************************************************************/
   .section  .isr_vector,"a",%progbits
  .type  g_pfnVectors, %object
  .size  g_pfnVectors, .-g_pfnVectors
   
   
g_pfnVectors:
  .word  _estack
  .word  Reset_Handler

  .word  NMI_Handler
  .word  HardFault_Handler
  .word  MemManage_Handler
  .word  BusFault_Handler
  .word  UsageFault_Handler
  .word  0
  .word  0
  .word  0
  .word  0
  .word  SVC_Handler
  .word  DebugMon_Handler
  .word  0
  .word  PendSV_Handler
  .word  SysTick_Handler


  .word IRQ_Trampoline_0
  .word IRQ_Trampoline_1
  .word IRQ_Trampoline_2
  .word IRQ_Trampoline_3
  .word IRQ_Trampoline_4
  .word IRQ_Trampoline_5
  .word IRQ_Trampoline_6
  .word IRQ_Trampoline_7
  .word IRQ_Trampoline_8
  .word IRQ_Trampoline_9
  .word IRQ_Trampoline_10
  .word IRQ_Trampoline_11
  .word IRQ_Trampoline_12
  .word IRQ_Trampoline_13
  .word IRQ_Trampoline_14
  .word IRQ_Trampoline_15
  .word IRQ_Trampoline_16
  .word IRQ_Trampoline_17
  .word IRQ_Trampoline_18
  .word IRQ_Trampoline_19
  .word IRQ_Trampoline_20
  .word IRQ_Trampoline_21
  .word IRQ_Trampoline_22
  .word IRQ_Trampoline_23
  .word IRQ_Trampoline_24
  .word IRQ_Trampoline_25
  .word IRQ_Trampoline_26
  .word IRQ_Trampoline_27
  .word IRQ_Trampoline_28
  .word IRQ_Trampoline_29
  .word IRQ_Trampoline_30
  .word IRQ_Trampoline_31
  .word IRQ_Trampoline_32
  .word IRQ_Trampoline_33
  .word IRQ_Trampoline_34
  .word IRQ_Trampoline_35
  .word IRQ_Trampoline_36
  .word IRQ_Trampoline_37
  .word IRQ_Trampoline_38
  .word IRQ_Trampoline_39
  .word IRQ_Trampoline_40
  .word IRQ_Trampoline_41
  .word IRQ_Trampoline_42
  .word IRQ_Trampoline_43
  .word IRQ_Trampoline_44
  .word IRQ_Trampoline_45
  .word IRQ_Trampoline_46
  .word IRQ_Trampoline_47
  .word IRQ_Trampoline_48
  .word IRQ_Trampoline_49
  .word IRQ_Trampoline_50
  .word IRQ_Trampoline_51
  .word IRQ_Trampoline_52
  .word IRQ_Trampoline_53
  .word IRQ_Trampoline_54
  .word IRQ_Trampoline_55
  .word IRQ_Trampoline_56
  .word IRQ_Trampoline_57
  .word IRQ_Trampoline_58
  .word IRQ_Trampoline_59
  .word IRQ_Trampoline_60
  .word IRQ_Trampoline_61
  .word IRQ_Trampoline_62
  .word IRQ_Trampoline_63
  .word IRQ_Trampoline_64
  .word IRQ_Trampoline_65
  .word IRQ_Trampoline_66
  .word IRQ_Trampoline_67
  .word IRQ_Trampoline_68
  .word IRQ_Trampoline_69
  .word IRQ_Trampoline_70
  .word IRQ_Trampoline_71
  .word IRQ_Trampoline_72
  .word IRQ_Trampoline_73
  .word IRQ_Trampoline_74
  .word IRQ_Trampoline_75
  .word IRQ_Trampoline_76
  .word IRQ_Trampoline_77
  .word IRQ_Trampoline_78
  .word IRQ_Trampoline_79
  .word IRQ_Trampoline_80
  .word IRQ_Trampoline_81
  .word IRQ_Trampoline_82
  .word IRQ_Trampoline_83
  .word IRQ_Trampoline_84
  .word IRQ_Trampoline_85
  .word IRQ_Trampoline_86
  .word IRQ_Trampoline_87
  .word IRQ_Trampoline_88
  .word IRQ_Trampoline_89
  .word IRQ_Trampoline_90
  .word IRQ_Trampoline_91
  .word IRQ_Trampoline_92
  .word IRQ_Trampoline_93
  .word IRQ_Trampoline_94
  .word IRQ_Trampoline_95
  .word IRQ_Trampoline_96
  .word IRQ_Trampoline_97
  .word IRQ_Trampoline_98
  .word IRQ_Trampoline_99
  .word IRQ_Trampoline_100
  .word IRQ_Trampoline_101
  .word IRQ_Trampoline_102
  .word IRQ_Trampoline_103
  
  /* External Interrupts */
  ; .word     WWDG_IRQHandler                   /* Window WatchDog              */                                        
  ; .word     PVD_IRQHandler                    /* PVD through EXTI Line detection */                        
  ; .word     TAMP_STAMP_IRQHandler             /* Tamper and TimeStamps through the EXTI line */            
  ; .word     RTC_WKUP_IRQHandler               /* RTC Wakeup through the EXTI line */                      
  ; .word     FLASH_IRQHandler                  /* FLASH                        */                                          
  ; .word     RCC_IRQHandler                    /* RCC                          */                                            
  ; .word     EXTI0_IRQHandler                  /* EXTI Line0                   */                        
  ; .word     EXTI1_IRQHandler                  /* EXTI Line1                   */                          
  ; .word     EXTI2_IRQHandler                  /* EXTI Line2                   */                          
  ; .word     EXTI3_IRQHandler                  /* EXTI Line3                   */                          
  ; .word     EXTI4_IRQHandler                  /* EXTI Line4                   */                          
  ; .word     DMA1_Stream0_IRQHandler           /* DMA1 Stream 0                */                  
  ; .word     DMA1_Stream1_IRQHandler           /* DMA1 Stream 1                */                   
  ; .word     DMA1_Stream2_IRQHandler           /* DMA1 Stream 2                */                   
  ; .word     DMA1_Stream3_IRQHandler           /* DMA1 Stream 3                */                   
  ; .word     DMA1_Stream4_IRQHandler           /* DMA1 Stream 4                */                   
  ; .word     DMA1_Stream5_IRQHandler           /* DMA1 Stream 5                */                   
  ; .word     DMA1_Stream6_IRQHandler           /* DMA1 Stream 6                */                   
  ; .word     ADC_IRQHandler                    /* ADC1, ADC2 and ADC3s         */                   
  ; .word     CAN1_TX_IRQHandler                /* CAN1 TX                      */                         
  ; .word     CAN1_RX0_IRQHandler               /* CAN1 RX0                     */                          
  ; .word     CAN1_RX1_IRQHandler               /* CAN1 RX1                     */                          
  ; .word     CAN1_SCE_IRQHandler               /* CAN1 SCE                     */                          
  ; .word     EXTI9_5_IRQHandler                /* External Line[9:5]s          */                          
  ; .word     TIM1_BRK_TIM9_IRQHandler          /* TIM1 Break and TIM9          */         
  ; .word     TIM1_UP_TIM10_IRQHandler          /* TIM1 Update and TIM10        */         
  ; .word     TIM1_TRG_COM_TIM11_IRQHandler     /* TIM1 Trigger and Commutation and TIM11 */
  ; .word     TIM1_CC_IRQHandler                /* TIM1 Capture Compare         */                          
  ; .word     TIM2_IRQHandler                   /* TIM2                         */                   
  ; .word     TIM3_IRQHandler                   /* TIM3                         */                   
  ; .word     TIM4_IRQHandler                   /* TIM4                         */                   
  ; .word     I2C1_EV_IRQHandler                /* I2C1 Event                   */                          
  ; .word     I2C1_ER_IRQHandler                /* I2C1 Error                   */                          
  ; .word     I2C2_EV_IRQHandler                /* I2C2 Event                   */                          
  ; .word     I2C2_ER_IRQHandler                /* I2C2 Error                   */                            
  ; .word     SPI1_IRQHandler                   /* SPI1                         */                   
  ; .word     SPI2_IRQHandler                   /* SPI2                         */                   
  ; .word     USART1_IRQHandler                 /* USART1                       */                   
  ; .word     USART2_IRQHandler                 /* USART2                       */                   
  ; .word     USART3_IRQHandler                 /* USART3                       */                   
  ; .word     EXTI15_10_IRQHandler              /* External Line[15:10]s        */                          
  ; .word     RTC_Alarm_IRQHandler              /* RTC Alarm (A and B) through EXTI Line */                 
  ; .word     OTG_FS_WKUP_IRQHandler            /* USB OTG FS Wakeup through EXTI line */                       
  ; .word     TIM8_BRK_TIM12_IRQHandler         /* TIM8 Break and TIM12         */         
  ; .word     TIM8_UP_TIM13_IRQHandler          /* TIM8 Update and TIM13        */         
  ; .word     TIM8_TRG_COM_TIM14_IRQHandler     /* TIM8 Trigger and Commutation and TIM14 */
  ; .word     TIM8_CC_IRQHandler                /* TIM8 Capture Compare         */                          
  ; .word     DMA1_Stream7_IRQHandler           /* DMA1 Stream7                 */                          
  ; .word     FMC_IRQHandler                    /* FMC                          */                   
  ; .word     SDMMC1_IRQHandler                 /* SDMMC1                       */                   
  ; .word     TIM5_IRQHandler                   /* TIM5                         */                   
  ; .word     SPI3_IRQHandler                   /* SPI3                         */                   
  ; .word     UART4_IRQHandler                  /* UART4                        */                   
  ; .word     UART5_IRQHandler                  /* UART5                        */                   
  ; .word     TIM6_DAC_IRQHandler               /* TIM6 and DAC1&2 underrun errors */                   
  ; .word     TIM7_IRQHandler                   /* TIM7                         */
  ; .word     DMA2_Stream0_IRQHandler           /* DMA2 Stream 0                */                   
  ; .word     DMA2_Stream1_IRQHandler           /* DMA2 Stream 1                */                   
  ; .word     DMA2_Stream2_IRQHandler           /* DMA2 Stream 2                */                   
  ; .word     DMA2_Stream3_IRQHandler           /* DMA2 Stream 3                */                   
  ; .word     DMA2_Stream4_IRQHandler           /* DMA2 Stream 4                */                   
  ; .word     ETH_IRQHandler                    /* Ethernet                     */                   
  ; .word     ETH_WKUP_IRQHandler               /* Ethernet Wakeup through EXTI line */                     
  ; .word     CAN2_TX_IRQHandler                /* CAN2 TX                      */                          
  ; .word     CAN2_RX0_IRQHandler               /* CAN2 RX0                     */                          
  ; .word     CAN2_RX1_IRQHandler               /* CAN2 RX1                     */                          
  ; .word     CAN2_SCE_IRQHandler               /* CAN2 SCE                     */                          
  ; .word     OTG_FS_IRQHandler                 /* USB OTG FS                   */                   
  ; .word     DMA2_Stream5_IRQHandler           /* DMA2 Stream 5                */                   
  ; .word     DMA2_Stream6_IRQHandler           /* DMA2 Stream 6                */                   
  ; .word     DMA2_Stream7_IRQHandler           /* DMA2 Stream 7                */                   
  ; .word     USART6_IRQHandler                 /* USART6                       */                    
  ; .word     I2C3_EV_IRQHandler                /* I2C3 event                   */                          
  ; .word     I2C3_ER_IRQHandler                /* I2C3 error                   */                          
  ; .word     OTG_HS_EP1_OUT_IRQHandler         /* USB OTG HS End Point 1 Out   */                   
  ; .word     OTG_HS_EP1_IN_IRQHandler          /* USB OTG HS End Point 1 In    */                   
  ; .word     OTG_HS_WKUP_IRQHandler            /* USB OTG HS Wakeup through EXTI */                         
  ; .word     OTG_HS_IRQHandler                 /* USB OTG HS                   */                   
  ; .word     DCMI_IRQHandler                   /* DCMI                         */                   
  ; .word     0                                 /* Reserved                     */                   
  ; .word     RNG_IRQHandler                    /* Rng                          */
  ; .word     FPU_IRQHandler                    /* FPU                          */
  ; .word     UART7_IRQHandler                  /* UART7                        */      
  ; .word     UART8_IRQHandler                  /* UART8                        */
  ; .word     SPI4_IRQHandler                   /* SPI4                         */
  ; .word     SPI5_IRQHandler                   /* SPI5                           */
  ; .word     SPI6_IRQHandler                   /* SPI6                         */
  ; .word     SAI1_IRQHandler                   /* SAI1                          */
  ; .word     LTDC_IRQHandler                   /* LTDC                          */
  ; .word     LTDC_ER_IRQHandler                /* LTDC error                      */
  ; .word     DMA2D_IRQHandler                  /* DMA2D                          */
  ; .word     SAI2_IRQHandler                   /* SAI2                         */
  ; .word     QUADSPI_IRQHandler                /* QUADSPI                      */
  ; .word     LPTIM1_IRQHandler                 /* LPTIM1                       */
  ; .word     CEC_IRQHandler                    /* HDMI_CEC                     */
  ; .word     I2C4_EV_IRQHandler                /* I2C4 Event                   */
  ; .word     I2C4_ER_IRQHandler                /* I2C4 Error                   */
  ; .word     SPDIF_RX_IRQHandler               /* SPDIF_RX                     */  
  
; /*******************************************************************************
; *
; * Provide weak aliases for each Exception handler to the Default_Handler. 
; * As they are weak aliases, any function with the same name will override 
; * this definition.
; * 
; *******************************************************************************/
  ;  .weak      NMI_Handler
  ;  .thumb_set NMI_Handler,Default_Handler
  
  ;  .weak      HardFault_Handler
  ;  .thumb_set HardFault_Handler,Default_Handler
  
  ;  .weak      MemManage_Handler
  ;  .thumb_set MemManage_Handler,Default_Handler
  
  ;  .weak      BusFault_Handler
  ;  .thumb_set BusFault_Handler,Default_Handler

  ;  .weak      UsageFault_Handler
  ;  .thumb_set UsageFault_Handler,Default_Handler

